In [1]:
from scipy.stats import ttest_1samp, mannwhitneyu
import numpy as np

import warnings
warnings.filterwarnings('ignore')
warnings.warn('DelftStack')
warnings.warn('Do not show this message')

In [2]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

In [3]:
from scipy.stats import shapiro

In [4]:
data = pd.read_csv("./ab_stats.csv")
data.head(5)

   revenue  num_purchases  purchase ab_group  av_site visit
0      0.0              0         0        A       9.040174
1      0.0              0         0        A       4.811628
2      0.0              0         0        A       7.342623
3      0.0              0         0        A       7.744581
4      0.0              0         0        A      10.511814

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23652 entries, 0 to 23651
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   revenue        23652 non-null  float64
 1   num_purchases  23652 non-null  int64
 2   purchase       23652 non-null  int64
 3   ab_group       23652 non-null  object
 4   av_site visit  23652 non-null  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 924.0+ KB

In [6]:
data.describe()

            revenue  num_purchases      purchase  av_site visit
count  23652.000000   23652.000000  23652.000000   23652.000000
mean       0.324689       0.043590      0.020717       7.013112
std        9.557730       1.079403      0.142438       3.154584
min        0.000000       0.000000      0.000000     -12.073486
25%        0.000000       0.000000      0.000000       5.173787
50%        0.000000       0.000000      0.000000       7.007936
75%        0.000000       0.000000      0.000000       8.864119
max     1303.609284     152.000000      1.000000      22.446822

In [7]:
data.ab_group.value_counts()

A    11835
B    11817
Name: ab_group, dtype: int64

In [8]:
data[data['av_site visit']<0].count()

revenue          468
num_purchases    468
purchase         468
ab_group         468
av_site visit    468
dtype: int64

In [9]:
data['av_site visit']=data['av_site visit'].abs()

In [10]:
data = data[data.purchase !=0]
data.head(-5)

         revenue  num_purchases  purchase ab_group  av_site visit
45      1.885595              1         1        A       7.654627
54      1.002159              1         1        A       6.392489
82      2.990000              1         1        A       8.596604
104    49.990000              1         1        A       8.885633
110    22.093757              4         1        A       8.708759
...          ...            ...       ...      ...            ...
22960   3.990000              1         1        B       5.960457
23116  11.018561              1         1        B       7.249111
23232   1.463510              3         1        B       6.905068
23301   2.542200              1         1        B       3.607058
23315  30.102912              4         1        B      10.595961

[485 rows x 5 columns]

In [11]:
data.ab_group.value_counts()

A    256
B    234
Name: ab_group, dtype: int64

In [12]:
mw_stats = mannwhitneyu(x=data[data['ab_group']=='A'].revenue.values,
                       y=data[data['ab_group']=='B'].revenue.values)
mw_stats

MannwhitneyuResult(statistic=29729.5, pvalue=0.8871956616344514)

# Статистически значимой разницы не обнаружено, оставляем исходный вариант.

In [16]:
arppu1 = data[data['ab_group']=='A']['revenue'].mean()
arppu2 = data[data['ab_group']=='B']['revenue'].mean()
arppu1,arppu2

(18.698468640624995, 12.362118756410235)

In [13]:
k1 = data[data['ab_group']=='A']['revenue'].sum()
k2 = data[data['ab_group']=='B']['revenue'].sum()
k1,k2

(4786.807972, 2892.7357889999985)

# Кроме того, суммарная выручка в контрольной группе больше почти в два раза.